mpovel/ARDUINO_EFM32/hardware/arm/EFM32/boards.txt
# Upload choices
EFM32G222.menu.upload_method.jLinkMethod=JLink
EFM32G222.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
EFM32G222.menu.upload_method.jLinkMethod.upload.protocol=jlink
EFM32G222.menu.upload_method.jLinkMethod.upload.device=EFM32G222F128

EFM32G222.menu.upload_method.serialMethod=Serial
EFM32G222.menu.upload_method.serialMethod.upload.protocol=maple_serial
EFM32G222.menu.upload_method.serialMethod.upload.tool=serial_upload


########################    EFM32TG110Fx    ###########################
EFM32TG110.name=EFM32TG110Fx

EFM32TG110.build.core=arduino
EFM32TG110.build.series=EFM32TG
EFM32TG110.build.variant=efm32Tg110
EFM32TG110.build.board=efm32Tg110f32
EFM32TG110.build.mcu=cortex-m3 -mthumb
#EFM32TG110.build.spacil_includes="-I{build.core.path}/efm32" "-I{build.system.path}" "-I{build.system.path}/emlib/inc" "-I{build.system.path}/emlib/src"

EFM32TG110.menu.cpu.32=EFM32TG110F32(32kFLASH 4kSRAM)
EFM32TG110.menu.cpu.32.build.board=efm32tg110f32
EFM32TG110.menu.cpu.32.build.extra_flags=-DARM_MATH_CM3 -DEFM32TG110F32
EFM32TG110.menu.cpu.32.build.ldscript=ld/efm32tg110f32.ld
EFM32TG110.menu.cpu.32.upload.maximum_size=32768
EFM32TG110.menu.cpu.32.upload.maximum_data_size=4096

EFM32TG110.menu.cpu.16=EFM32TG110F16(16kFLASH 4kSRAM)
EFM32TG110.menu.cpu.16.build.board=efm32tg110f16
EFM32TG110.menu.cpu.16.build.extra_flags=-DARM_MATH_CM3 -DEFM32TG110F16
EFM32TG110.menu.cpu.16.build.ldscript=ld/efm32tg110f16.ld
EFM32TG110.menu.cpu.16.upload.maximum_size=16384
EFM32TG110.menu.cpu.16.upload.maximum_data_size=4096

EFM32TG110.build.f_cpu=32000000L
EFM32TG110.menu.clock_source.hfrc28=HFRCO (28MHz)
EFM32TG110.menu.clock_source.hfrc28.build.osc=28000000L  -DUSE_HFRCO
EFM32TG110.menu.clock_source.hfrc28.build.f_cpu=28000000L -DOSC{build.osc}
EFM32TG110.menu.clock_source.hfrc21=HFRCO (21MHz)
EFM32TG110.menu.clock_source.hfrc21.build.osc=21000000L  -DUSE_HFRCO
EFM32TG110.menu.clock_source.hfrc21.build.f_cpu=21000000L -DOSC{build.osc}
EFM32TG110.menu.clock_source.hfrc14=HFRCO (14MHz)
EFM32TG110.menu.clock_source.hfrc14.build.osc=14000000L  -DUSE_HFRCO
EFM32TG110.menu.clock_source.hfrc14.build.f_cpu=14000000L -DOSC{build.osc}
EFM32TG110.menu.clock_source.hfrc11=HFRCO (11MHz)
EFM32TG110.menu.clock_source.hfrc11.build.osc=11000000L  -DUSE_HFRCO
EFM32TG110.menu.clock_source.hfrc11.build.f_cpu=11000000L -DOSC{build.osc}
#EFM32TG110.menu.clock_source.lfrc=LFRCO
#EFM32TG110.menu.clock_source.lfrc.build.osc=32768L -DUSE_LFRCO
#EFM32TG110.menu.clock_source.hfxo=HFXO 32M
#EFM32TG110.menu.clock_source.hfxO.build.osc=3200000L -DUSE_HFXO
#EFM32TG110.menu.clock_source.Lfxo=LFXO
#EFM32TG110.menu.clock_source.LfxO.build.osc=32768L -DUSE_LFXO

EFM32TG110.menu.serial.leserial=LEUART0(1#PB13/14,3#PF0/1,4#PF2/PA0)
EFM32TG110.menu.serial.leserial.build.extra_flags_serial=-DMENU_SERIAL=SerialLEUART0
EFM32TG110.menu.serial.serial1=USART1(0#PD0/1,2#PD7/6)
EFM32TG110.menu.serial.serial1.build.extra_flags_serial=-DMENU_SERIAL=SerialUSART1

EFM32TG110.build.vect=VECT_TAB_OFFSET=0x0000000
EFM32TG110.build.runin=FLASH
EFM32TG110.build.uploadadr=0x00000000

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
EFM32TG110.menu.log.default=Release(no-exceptions)
EFM32TG110.menu.log.default.build.log_level=-fno-exceptions
EFM32TG110.menu.log.Release=Release(exceptions)
EFM32TG110.menu.log.Release.build.log_level=
EFM32TG110.menu.log.fatal=FATAL
EFM32TG110.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DDEBUG_EFM
EFM32TG110.menu.log.error=ERROR
EFM32TG110.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DDEBUG_EFM
EFM32TG110.menu.log.warning=WARNING
EFM32TG110.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DDEBUG_EFM
EFM32TG110.menu.log.info=INFO
EFM32TG110.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DDEBUG_EFM
EFM32TG110.menu.log.debug=DEBUG
EFM32TG110.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DDEBUG_EFM
EFM32TG110.menu.log.trace=TRACE
EFM32TG110.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DDEBUG_EFM

#--------------------------UPLOAD METHODS------------------------------
EFM32TG110.upload.file_type=bin
EFM32TG110.upload.params.quiet=no
EFM32TG110.upload.use_1200bps_touch=false
EFM32TG110.upload.auto_reset=fauls

# Upload choices
EFM32TG110.menu.upload_method.jLinkMethod=JLink
EFM32TG110.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
EFM32TG110.menu.upload_method.jLinkMethod.upload.protocol=jlink
EFM32TG110.menu.upload_method.jLinkMethod.upload.device=EFM32G222F128

EFM32TG110.menu.upload_method.serialMethod=Serial
EFM32TG110.menu.upload_method.serialMethod.upload.protocol=maple_serial
EFM32TG110.menu.upload_method.serialMethod.upload.tool=serial_upload

################################################################